---
kind: type
id: T:Autodesk.Revit.DB.ExternalResourceServerUtils
source: html/a3147faa-ddc7-6cc1-8906-260582b6bc4a.htm
---
# Autodesk.Revit.DB.ExternalResourceServerUtils

Contains utilities related to external resource server.

## Syntax (C#)
```csharp
public static class ExternalResourceServerUtils
```